# Importar las librerías

In [2]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

# Importar el data set

In [3]:
dataset = pd.read_csv('Data.csv')
X = dataset.iloc[:, :-1].values
y = dataset.iloc[:, 3].values

In [4]:
dataset.head(9)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No

Se aprecia el valor *Nan* en la cuarta fila de la solumna **Salary** y en la sexta columna de **Age**.

In [5]:
print("Antes de transformar los datos: ")
print("X: " + str(X))
print("y: " + str(y))

Antes de transformar los datos:
X: [['France' 44.0 72000.0]
 ['Spain' 27.0 48000.0]
 ['Germany' 30.0 54000.0]
 ['Spain' 38.0 61000.0]
 ['Germany' 40.0 nan]
 ['France' 35.0 58000.0]
 ['Spain' nan 52000.0]
 ['France' 48.0 79000.0]
 ['Germany' 50.0 83000.0]
 ['France' 37.0 67000.0]]
y: ['No' 'Yes' 'No' 'No' 'Yes' 'Yes' 'No' 'Yes' 'No' 'Yes']

# Tratamiento de los NAs

In [6]:
from sklearn.impute import SimpleImputer

Simple imputer [information](https://scikit-learn.org/stable/modules/generated/sklearn.impute.SimpleImputer.html)

Solo nos interesa aplicar el método a las columnas **Age** y **Salary**.

In [7]:
imputer = SimpleImputer(missing_values = np.nan, # Tipo de dato faltante
                        strategy = "mean", # Método para asignar valor al dato faltante
                        verbose=0 # Se toma la media de la columna, con 1 es para la fila
                       ) # Creación del objeto
imputer = imputer.fit(X[:,1:3]) # Creamos el array con los datos transformados
X[:, 1:3] = imputer.transform(X[:,1:3]) # Sustituímos los valores en ela rray orignal
print(X.shape)

(10, 3)

In [8]:
result = pd.DataFrame({'Column1': X[:, 0], 'Column2': X[:, 1],'Column3': X[:, 2]})

Veamos los cambios:

In [9]:
display(result)

   Column1    Column2       Column3
0   France       44.0       72000.0
1    Spain       27.0       48000.0
2  Germany       30.0       54000.0
3    Spain       38.0       61000.0
4  Germany       40.0  63777.777778
5   France       35.0       58000.0
6    Spain  38.777778       52000.0
7   France       48.0       79000.0
8  Germany       50.0       83000.0
9   France       37.0       67000.0